Конфигурация/Documents/ОперацияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОперацияНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗаписиКнигиПокупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
								<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПлановыеДатыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеДатыОплат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыНачисленоУплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоПоАктуПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ОперацияНДС/Ext/ObjectModule.bsl
Процедура ЗаполнитьСчетНДСВСтрокеОснования(СтрокаОснования) Экспорт
	
	ТипОснования = ТипЗнч(СтрокаОснования.Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости") Тогда
		СтрокаОснования.СчетНДС = ПланыСчетов.Основной.НДСПоПриобретеннымОС;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		ЭтоНДСПоОбщимРасходам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОснования.Основание, "НДСПоОбщимРасходам");
		СтрокаОснования.СчетНДС = ?(ЭтоНДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоПрямымРасходам);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацияНДСОснования.Основание КАК Основание,
		|	ОперацияНДСОснования.СуммаНДС КАК СуммаНДС,
		|	ОперацияНДСОснования.СчетНДС КАК СчетНДС,
		|	ВЫБОР
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.АктПриемаПередачиОбъектовНедвижимости
		|			ТОГДА ЛОЖЬ
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).НДСПоОбщимРасходам
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Распределение,
		|	ВЫБОР
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).ПрочиеДоходыИРасходы
		|	КОНЕЦ КАК АналитикаРасхода,
		|	ВЫБОР
		|		КОГДА НЕ СделкаСНедвижимостью.Ссылка ЕСТЬ NULL
		|			ТОГДА СделкаСНедвижимостью.Контрагент
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).Контрагент
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.ВводПрочихАктивов
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание.Основание КАК Документ.ЗаявкаПайщика).Пайщик
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА НЕ АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|			ТОГДА АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).НомерСчетаФактуры
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСчетаФактуры,
		|	ВЫБОР
		|		КОГДА НЕ АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|			ТОГДА АктПриемаПередачиОбъектовНедвижимости.ДатаСчетаФактуры
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).ДатаСчетаФактуры
		|		ИНАЧЕ &Период
		|	КОНЕЦ КАК ДатаСчетаФактуры,
		|	ОперацияНДСОснования.Ссылка.Организация КАК Организация,
		|	ОперацияНДСОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&ИФНС КАК ИФНС
		|ИЗ
		|	Документ.ОперацияНДС.Основания КАК ОперацияНДСОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
		|		ПО ОперацияНДСОснования.Основание = АктПриемаПередачиОбъектовНедвижимости.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности КАК СведенияОРегистрацииПраваСобственности
		|		ПО ОперацияНДСОснования.Основание = СведенияОРегистрацииПраваСобственности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО (АктПриемаПередачиОбъектовНедвижимости.Основание = СделкаСНедвижимостью.Ссылка
		|				ИЛИ СведенияОРегистрацииПраваСобственности.Основание = СделкаСНедвижимостью.Ссылка)
		|ГДЕ
		|	ОперацияНДСОснования.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА НЕ АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|			ТОГДА АктПриемаПередачиОбъектовНедвижимости.ДатаСчетаФактуры
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).ДатаСчетаФактуры
		|		ИНАЧЕ &Период
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|			ТОГДА АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).НомерСчетаФактуры
		|		ИНАЧЕ """"
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ИФНС", РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.Распределение Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС, "Зачтен НДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			// кредит
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетНДС;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
			
		Иначе
			
			СуммаКЗачету = Окр(ВыборкаДетальныеЗаписи.СуммаНДС * ЭтотОбъект.КоэффициентРаспределения, 2);
			
			//зачли
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаКЗачету, "Зачтен НДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			// кредит
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетНДС;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
			
			//на расходы
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС - СуммаКЗачету, "Зачтен НДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаРасхода;
			
			// кредит
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетНДС;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
			
		КонецЕсли;
	КонецЦикла;
	
	Движения[УчетныйРегистр].Записать();
	
	Если ТребуетсяЗакрытиеКвартала() Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&КонецДня,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НДС),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки";
		
		Запрос.УстановитьПараметр("КонецДня", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Копейки = ВыборкаДетальныеЗаписи.СуммаОстаток - Окр(ВыборкаДетальныеЗаписи.СуммаОстаток);
			
			Если Копейки > 0 Тогда 
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Копейки, "Округление суммы налога");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "АналитикаОкругленияНалогов");
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Основной.НДС;
				Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
				
			ИначеЕсли Копейки < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], - Копейки, "Округление суммы налога");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Основной.НДС;
				Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "АналитикаОкругленияНалогов");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записать(Истина);
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацияНДСОснования.Основание КАК Основание,
		|	ОперацияНДСОснования.СуммаНДС КАК Сумма,
		|	ВЫБОР
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.АктПриемаПередачиОбъектовНедвижимости
		|			ТОГДА ЛОЖЬ
		|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).НДСПоОбщимРасходам
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Распределение,
		|	ОперацияНДСОснования.Ссылка.Организация КАК Организация,
		|	ОперацияНДСОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&ВалютаРубли КАК Валюта,
		|	&ИФНС КАК Контрагент
		|ПОМЕСТИТЬ _СтрокиДокумента
		|ИЗ
		|	Документ.ОперацияНДС.Основания КАК ОперацияНДСОснования
		|ГДЕ
		|	ОперацияНДСОснования.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтрокиДокумента.Основание КАК Основание,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская) КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям) КАК ВидЗадолженности,
		|	_СтрокиДокумента.Организация КАК Организация,
		|	_СтрокиДокумента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СтрокиДокумента.Валюта КАК Валюта,
		|	_СтрокиДокумента.Контрагент КАК Контрагент,
		|	ЛОЖЬ КАК Аванс,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	_СтрокиДокумента.Сумма КАК Сумма
		|ПОМЕСТИТЬ _ЗачетИРаспределениеНДС
		|ИЗ
		|	_СтрокиДокумента КАК _СтрокиДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СтрокиДокумента.Основание,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода),
		|	_СтрокиДокумента.Организация,
		|	_СтрокиДокумента.СчетДоверительногоУправления,
		|	_СтрокиДокумента.Валюта,
		|	_СтрокиДокумента.Контрагент,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Период,
		|	ВЫБОР
		|		КОГДА НЕ _СтрокиДокумента.Распределение
		|			ТОГДА 1
		|		ИНАЧЕ &КоэффициентРаспределения
		|	КОНЕЦ * _СтрокиДокумента.Сумма
		|ИЗ
		|	_СтрокиДокумента КАК _СтрокиДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ _ОстаткиТекущегоНДС
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			КОНЕЦПЕРИОДА(&Период, КВАРТАЛ),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода)
		|				И &ТребуетсяЗакрытиеКвартала) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗачетИРаспределениеНДС.ТипЗадолженности,
		|	_ЗачетИРаспределениеНДС.Основание,
		|	_ЗачетИРаспределениеНДС.Валюта,
		|	_ЗачетИРаспределениеНДС.Контрагент,
		|	_ЗачетИРаспределениеНДС.Сумма,
		|	_ЗачетИРаспределениеНДС.ВидЗадолженности
		|ИЗ
		|	_ЗачетИРаспределениеНДС КАК _ЗачетИРаспределениеНДС
		|ГДЕ
		|	_ЗачетИРаспределениеНДС.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода)
		|	И &ТребуетсяЗакрытиеКвартала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиТекущегоНДС.Контрагент КАК Контрагент,
		|	СУММА(ВЫБОР
		|			КОГДА _ОстаткиТекущегоНДС.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ * _ОстаткиТекущегоНДС.СуммаОстаток) КАК СуммаНалогаЗаКвартал
		|ПОМЕСТИТЬ _НалогДоОкругления
		|ИЗ
		|	_ОстаткиТекущегоНДС КАК _ОстаткиТекущегоНДС
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиТекущегоНДС.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НалогДоОкругления.Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(_НалогДоОкругления.СуммаНалогаЗаКвартал КАК ЧИСЛО(15, 0)) КАК СуммаНалогаЗаКвартал
		|ПОМЕСТИТЬ _НалогПослеОкругления
		|ИЗ
		|	_НалогДоОкругления КАК _НалогДоОкругления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗачетИРаспределениеНДС.Основание КАК Основание,
		|	_ЗачетИРаспределениеНДС.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗачетИРаспределениеНДС.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗачетИРаспределениеНДС.Организация КАК Организация,
		|	_ЗачетИРаспределениеНДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗачетИРаспределениеНДС.Валюта КАК Валюта,
		|	_ЗачетИРаспределениеНДС.Контрагент КАК Контрагент,
		|	_ЗачетИРаспределениеНДС.Аванс КАК Аванс,
		|	_ЗачетИРаспределениеНДС.ВидДвижения КАК ВидДвижения,
		|	_ЗачетИРаспределениеНДС.Период КАК Период,
		|	_ЗачетИРаспределениеНДС.Сумма КАК Сумма
		|ИЗ
		|	_ЗачетИРаспределениеНДС КАК _ЗачетИРаспределениеНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиТекущегоНДС.Основание,
		|	_ОстаткиТекущегоНДС.ТипЗадолженности,
		|	_ОстаткиТекущегоНДС.ВидЗадолженности,
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	_ОстаткиТекущегоНДС.Валюта,
		|	_ОстаткиТекущегоНДС.Контрагент,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&Период,
		|	_ОстаткиТекущегоНДС.СуммаОстаток
		|ИЗ
		|	_ОстаткиТекущегоНДС КАК _ОстаткиТекущегоНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ссылка,
		|	ВЫБОР
		|		КОГДА _НалогПослеОкругления.СуммаНалогаЗаКвартал > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость),
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&ВалютаРубли,
		|	&ИФНС,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Период,
		|	_НалогПослеОкругления.СуммаНалогаЗаКвартал * ВЫБОР
		|		КОГДА _НалогПослеОкругления.СуммаНалогаЗаКвартал > 0
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ
		|ИЗ
		|	_НалогПослеОкругления КАК _НалогПослеОкругления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ИФНС", РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
	Запрос.УстановитьПараметр("ВалютаРубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("КоэффициентРаспределения", ЭтотОбъект.КоэффициентРаспределения);
	Запрос.УстановитьПараметр("ТребуетсяЗакрытиеКвартала", ТребуетсяЗакрытиеКвартала());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.ЗадолженностиПоДенежнымСредствам.Загрузить(РезультатЗапроса.Выгрузить());
	
	Движения.Записать();
	
	Если Движения.ЗадолженностиПоДенежнымСредствам.Количество() <> 0 Тогда
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РегистрыСведений.ПлановыеДатыОплат.СформироватьДвижения(ЭтотОбъект);

КонецПроцедуры

Функция ТребуетсяЗакрытиеКвартала()
	
	//Это последний рабочий день квартала
	Возврат (Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский,НачалоДня(ЭтотОбъект.Дата))
		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский,НачалоДня(КонецКвартала(ЭтотОбъект.Дата))));
	
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.Основания.Количество() = 0 И НЕ ТребуетсяЗакрытиеКвартала() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо проведение операции НДС с пустой табличной частью!", ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОперацияНДСОснования.Основание КАК Основание,
			|	ОперацияНДСОснования.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.НачислениеЗадолженности
			|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.НачислениеЗадолженности).НомерСчетаФактуры
			|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.АктПриемаПередачиОбъектовНедвижимости
			|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.АктПриемаПередачиОбъектовНедвижимости).НомерСчетаФактуры
			|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.СведенияОРегистрацииПраваСобственности
			|			ТОГДА ЕСТЬNULL(АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры, """")
			|		КОГДА ОперацияНДСОснования.Основание ССЫЛКА Документ.ВводПрочихАктивов
			|			ТОГДА ВЫРАЗИТЬ(ОперацияНДСОснования.Основание КАК Документ.ВводПрочихАктивов).НомерВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерСчетаФактуры,
			|	ОперацияНДСОснования.Основание.Представление КАК ОснованиеПредставление
			|ИЗ
			|	Документ.ОперацияНДС.Основания КАК ОперацияНДСОснования
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|				&Момент,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И СведенияОГосРегистрацииПраваСобственности В
			|						(ВЫБРАТЬ
			|							ОперацияНДСОснования.Основание КАК Основание
			|						ИЗ
			|							Документ.ОперацияНДС.Основания КАК ОперацияНДСОснования
			|						ГДЕ
			|							ОперацияНДСОснования.Ссылка = &Ссылка
			|							И ОперацияНДСОснования.Основание ССЫЛКА Документ.СведенияОРегистрацииПраваСобственности)) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|		ПО ОперацияНДСОснования.Основание = УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
			|		ПО (УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = АктПриемаПередачиОбъектовНедвижимости.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводПрочихАктивов КАК ВводПрочихАктивов
			|		ПО (УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ВводПрочихАктивов.Ссылка)
			|ГДЕ
			|	ОперацияНДСОснования.Ссылка = &Ссылка";
		
		Запрос.Параметры.Вставить("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.Параметры.Вставить("Организация", ЭтотОбъект.Организация);
		Запрос.Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.Параметры.Вставить("Момент", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если СокрЛП(ВыборкаДетальныеЗаписи.НомерСчетаФактуры) = "" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + Строка(ВыборкаДетальныеЗаписи.НомерСтроки) + " для документа " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + " не указан номер счета-фактуры! ", ЭтотОбъект, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",,Отказ); 
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
